# Introduction to Pandas

### 5th Summer School on INtelligent signal processing for FrontIEr Research and Industry, Wuhan, May 2019


### 10 minutes introduction

Inspired by https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html and https://pandas.pydata.org/pandas-docs/stable/user_guide/cookbook.html#cookbook

Pandas is one of the most popular Python libraries for Data Science. Pandas manages two-dimensional data tables in Python.

Pandas deals with these three data structures:

    Series: 1D labeled homogeneous array, sizeimmutable
    DataFrame: General 2D labeled, size-mutable tabular structure
    Panel: General 3D labeled, size-mutable array

In our Top Tagging exercise, we will use DataFrames.

Import pandas library

In [237]:
import pandas as pd

Write a pandas DataFrame and print it out:

In [238]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7], 'BBB': [10, 20, 30, 40], 'CCC': [100, 50, -30, -50]})

In [239]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

Print out the shape of the DataFrame, its indices and columns:

In [240]:
print(df.shape)

(4, 3)

In [241]:
print(df.index)
print(df.columns)

RangeIndex(start=0, stop=4, step=1)
Index([u'AAA', u'BBB', u'CCC'], dtype='object')

Transposing your data:

In [242]:
df.T

       0   1   2   3
AAA    4   5   6   7
BBB   10  20  30  40
CCC  100  50 -30 -50

Sorting by an axis:

In [248]:
df.sort_index(axis=0, ascending=False)
#it sorts the rows in descending order, w.r.t. the index

   AAA  BBB  CCC
3    7   40  -50
2    6   30  -30
1    5   20   50
0    4   10  100

In [251]:
df.sort_index(axis=1, ascending=False)
#it sorts the columns in descending order, i.e. 'CCC' comes before 'AAA'

   CCC  BBB  AAA
0  100   10    4
1   50   20    5
2  -30   30    6
3  -50   40    7

Sorting by values:

In [252]:
df.sort_values(by='CCC')
#it sorts the rows in ascending order w.r.t. column "CCC"

   AAA  BBB  CCC
3    7   40  -50
2    6   30  -30
1    5   20   50
0    4   10  100

Print the number of rows:

In [253]:
print(len(df.index))

4

### Selecting by label

Selecting multiple columns:

In [254]:
df.loc[:, ['AAA', 'BBB']]

   AAA  BBB
0    4   10
1    5   20
2    6   30
3    7   40

Showing label slicing, both endpoints are included:

In [255]:
df.loc[0:2, ['AAA', 'BBB']]

   AAA  BBB
0    4   10
1    5   20
2    6   30

Accessing a scalar:

In [256]:
df.at[0,'AAA']

4

It also works:

In [257]:
df.loc[0,'AAA']

4

Accessing a column, with index:

In [258]:
df.AAA

0    4
1    5
2    6
3    7
Name: AAA, dtype: int64

In [259]:
df["AAA"]

0    4
1    5
2    6
3    7
Name: AAA, dtype: int64

### Selecting by position

Select via the position of the passed integers (i.e., it shows the row at that position):

In [260]:
df.iloc[0]
#it shows the first row

AAA      4
BBB     10
CCC    100
Name: 0, dtype: int64

In [261]:
df.iloc[1]
#it shows the second row

AAA     5
BBB    20
CCC    50
Name: 1, dtype: int64

By integer slices, similar to numpy/python:

In [262]:
df.iloc[0:3]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30

In [263]:
df.iloc[0:3,0:1]

   AAA
0    4
1    5
2    6

For slicing rows explicitly:

In [264]:
df.iloc[0:2, :]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

For slicing columns explicitly:

In [265]:
df.iloc[:, 0:3]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

For getting a value explicitly:

In [266]:
df.iloc[0, 0]

4

Equivalent:

In [267]:
df.iat[1, 1]

20

### Boolean Indexing

Using a single columnâ€™s values to select data.

In [268]:
df[df.AAA > 0]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [269]:
df.loc[df.AAA>5]

   AAA  BBB  CCC
2    6   30  -30
3    7   40  -50

In [270]:
df.AAA.loc[df.AAA>5]

2    6
3    7
Name: AAA, dtype: int64

Logic expressions:

In [272]:
df.loc[(df['BBB'] < 25) & (df['CCC'] >= -40)]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

In [273]:
df.loc[(df['BBB'] < 25) & (df['CCC'] >= -40), 'AAA']

0    4
1    5
Name: AAA, dtype: int64

Selecting values from a DataFrame where a boolean condition is met:

In [274]:
df[df>0]

   AAA  BBB    CCC
0    4   10  100.0
1    5   20   50.0
2    6   30    NaN
3    7   40    NaN

Using the isin() method for filtering:

In [275]:
df[df['AAA'].isin([0, 4, 5])]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

It works also for indices:

In [276]:
df.loc[df.index.isin([0, 2, 4])]

   AAA  BBB  CCC
0    4   10  100
2    6   30  -30

Overwriting the elements:

In [277]:
df.loc[df.AAA >= 5, 'BBB'] = -1
df

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

### Other operations

Restoring the dataframe, since we modified it in the previous box:

In [278]:
df = pd.DataFrame({'AAA': [4, 5, 6, 7], 'BBB': [10, 20, 30, 40], 'CCC': [100, 50, -30, -50]})
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

Copying a full df:

In [279]:
df_copy = df.copy()
df_copy

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

Copy only part of the df:

In [280]:
df2 = pd.DataFrame(data=df, index=[0, 1])
df2

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

Sort by column:

In [281]:
df.sort_values(by=('CCC'), ascending=True)

   AAA  BBB  CCC
3    7   40  -50
2    6   30  -30
1    5   20   50
0    4   10  100

Define a new column that is the sum of two different columns:

In [283]:
df["DDD"] = df["AAA"] + df["BBB"]

df

   AAA  BBB  CCC  DDD
0    4   10  100   14
1    5   20   50   25
2    6   30  -30   36
3    7   40  -50   47

Statistics operations:

Mean on axis 0:

In [284]:
df.mean(0)

AAA     5.5
BBB    25.0
CCC    17.5
DDD    30.5
dtype: float64

Mean on axis 1:

In [285]:
df.mean(1)

0    32.0
1    25.0
2    10.5
3    11.0
dtype: float64

Apply a function:

In [286]:
df.apply(lambda x: x.max() - x.min())

AAA      3
BBB     30
CCC    150
DDD     33
dtype: int64

Append rows to a dataframe:

In [287]:
s = df.iloc[3]
#Add one row, identical to row with index 3
df.append(s, ignore_index=True)

   AAA  BBB  CCC  DDD
0    4   10  100   14
1    5   20   50   25
2    6   30  -30   36
3    7   40  -50   47
4    7   40  -50   47

## Reading and writing HDF5

HDFStore is a dict-like object which reads and writes pandas using the high performance HDF5 format using the excellent PyTables library (https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#io-hdf5)

Writing to a HDF5 Store:

In [291]:
df.to_hdf('foo.h5', 'df')
#We are saving the df with the name 'df' in 'foo.h5' file

Reading from a HDF5 Store:

In [292]:
store = pd.HDFStore('foo.h5')

In [293]:
df3 = store.select("df")
df3

   AAA  BBB  CCC  DDD
0    4   10  100   14
1    5   20   50   25
2    6   30  -30   36
3    7   40  -50   47

### Table format

HDFStore supports another PyTables format, the table format. Conceptually a table is shaped very much like a DataFrame, with rows and columns. A table may be appended to in the same or other sessions. In addition, delete and query type operations are supported. This format is specified by format='table' or format='t' to to_hdf. More: https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#io-hdf5

Write the df as a table:

In [294]:
df3.to_hdf('table_foo.h5', 'table', format='table')

Read the h5 file:

In [295]:
store_table = pd.HDFStore('table_foo.h5')

start and stop parameters can be specified to limit the total search space. These are in terms of the total number of rows in a table.

In [296]:
df_table = store_table.select("table",start=0,stop=2)
df_table

   AAA  BBB  CCC  DDD
0    4   10  100   14
1    5   20   50   25

The columns keyword can be supplied to select a list of columns to be returned:

In [297]:
store_table.select('table', "columns=['AAA', 'CCC']")

   AAA  CCC
0    4  100
1    5   50
2    6  -30
3    7  -50